import React, {useState} from 'react';
import {Grid2} from "@mui/material";
import {PatientSearchForm} from "../PatientSearchForm";
import {AnalysisTable} from "./components/AnalysisTable";
import MockAdapter from "axios-mock-adapter";
import axios from "axios";
import {Syndromes} from "./components/Syndromes";

export const AnalysisDescription: React.FC = () => {
    const [analysisData, setAnalysisData] = useState<any>(null);

    const mock = new MockAdapter(axios);

    // Мокаем ответ для тестирования
    mock.onGet(/get-analysis-description\/\d{3}-\d{3}-\d{3} \d{2}/).reply(200, {
        "fio": "Иванов Иван Иванович",
        "analysis": [
            {
                "Маркеры": "СРБ",
                "Значение": 2.9,
                "Норма": "0-6",
                "Ед.изм.": "мг/л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Лейкоциты",
                "Значение": 13.0,
                "Норма": "4,0-9,0",
                "Ед.изм.": "10 в 9ст/л",
                "Отклонение": "Повышение уровня лейкоцитов в крови"
            },
            {
                "Маркеры": "Фибриноген",
                "Значение": 3.3,
                "Норма": "1,8-4,0",
                "Ед.изм.": "г/л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "СОЭ (Муж)",
                "Значение": 20.0,
                "Норма": "1-15",
                "Ед.изм.": "мм/ч",
                "Отклонение": "Повышение  СОЭ"
            },
            {
                "Маркеры": "Палочкоядерные нейтрофилы",
                "Значение": 3.8,
                "Норма": "1-6",
                "Ед.изм.": "%",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Сегментоядерные нейтрофилы",
                "Значение": 60.0,
                "Норма": "47-72",
                "Ед.изм.": "%",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Базофилы",
                "Значение": 0.5,
                "Норма": "0-1",
                "Ед.изм.": "%",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Моноциты",
                "Значение": 5.0,
                "Норма": "3-11",
                "Ед.изм.": "%",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Лимфоциты",
                "Значение": 26.0,
                "Норма": "19-37",
                "Ед.изм.": "%",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Эозинофилы",
                "Значение": 2.2,
                "Норма": "0,5-5,0",
                "Ед.изм.": "%",
                "Отклонение": "Повышение уровня эозинофилов "
            },
            {
                "Маркеры": "Глюкоза",
                "Значение": 5.3,
                "Норма": "3,6-6,0",
                "Ед.изм.": "ммоль/л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Глюкоза",
                "Значение": 5.3,
                "Норма": "3,6-6,0",
                "Ед.изм.": "ммоль/л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Натрий",
                "Значение": 136.0,
                "Норма": "135-148",
                "Ед.изм.": "ммоль/л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Натрий",
                "Значение": 136.0,
                "Норма": "135-148",
                "Ед.изм.": "ммоль/л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Калий",
                "Значение": 4.8,
                "Норма": "3,5-5,3",
                "Ед.изм.": "ммоль/л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Калий",
                "Значение": 4.8,
                "Норма": "3,5-5,3",
                "Ед.изм.": "ммоль/л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Креатинин (Муж)",
                "Значение": 87.0,
                "Норма": "71-115   \n",
                "Ед.изм.": "мкмоль/л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Фибриноген",
                "Значение": 3.3,
                "Норма": "1,8-4,0",
                "Ед.изм.": "г/л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Тромбоциты",
                "Значение": 270.0,
                "Норма": "180-320",
                "Ед.изм.": "10 9/л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Гемоглобин (Муж)",
                "Значение": 152.0,
                "Норма": "130-160",
                "Ед.изм.": "г/л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Среднее содержание гемоглобина в эритроците, MCH",
                "Значение": 30.0,
                "Норма": "30-35 ",
                "Ед.изм.": "пг",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Средняя концентрация гемоглобина в эритроците, MCHC (Муж)",
                "Значение": 340.0,
                "Норма": "320-360",
                "Ед.изм.": "г/л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Средний объем эритроцита, MCV",
                "Значение": 86.0,
                "Норма": "80-100",
                "Ед.изм.": "фл",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Эритроциты",
                "Значение": 15.0,
                "Норма": "3,7-4,7",
                "Ед.изм.": "10 в 12 ст./л",
                "Отклонение": NaN
            },
            {
                "Маркеры": "Гематокрит",
                "Значение": 40.0,
                "Норма": "36-48",
                "Ед.изм.": "%",
                "Отклонение": NaN
            }
        ],
        "syndromes": [
            {
                "system": "Иммунная система",
                "problems": ["Аллергическая сенсибилизация", "Воспалительный ответ"]
            }
        ]
    });


    const handleReceiveData = (data: any) => {
        setAnalysisData(data);
    };

    return (
        <Grid2 container direction="row" justifyContent="center">
            <Grid2>
                <PatientSearchForm onReceiveData={handleReceiveData}/>
                {analysisData != null && (
                    <Grid2 rowGap="XL">
                        <Grid2>
                            <strong style={{marginBottom: '16px'}}>ФИО: {analysisData.fio}</strong>
                            <Syndromes syndromes={analysisData.syndromes}/>
                        </Grid2>
                        <Grid2 sx={{marginTop: '20px'}}>
                            <AnalysisTable data={analysisData}/>
                        </Grid2>
                    </Grid2>
                )}
            </Grid2>
        </Grid2>
    );
};
